esoeproject/esoeproject/saml2cpp/includes/handlers/impl/UnmarshallerImpl.h
/*
 * Copyright 2006-2007, Queensland University of Technology
 * Licensed under the Apache License, Version 2.0 (the "License"); you may not 
 * use this file except in compliance with the License. You may obtain a copy of 
 * the License at 
 * 
 *   http://www.apache.org/licenses/LICENSE-2.0 
 * 
 * Unless required by applicable law or agreed to in writing, software 
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT 
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied. See the 
 * License for the specific language governing permissions and limitations under 
 * the License.
 * 
 * Author: Bradley Beddoes
 * Creation Date: 19/12/2006
 * 
 * Purpose: Concrete implementation of all unmarshalling operations supported by saml2lib-cpp
 */

#ifndef UNMARSHALLERIMPL_H_
#define UNMARSHALLERIMPL_H_

/* STL */
#include <exception>
#include <string>
#include <vector>

/* XML Security */
#include <xsec/dsig/DSIGSignature.hpp>
#include <xsec/dsig/DSIGReference.hpp>
#include <xsec/dsig/DSIGTransformList.hpp>
#include <xsec/enc/XSECCryptoException.hpp>
#include <xsec/enc/XSECCryptoKey.hpp>
#include <xsec/framework/XSECProvider.hpp>
#include <xsec/framework/XSECException.hpp>

/* Xerces */
#include <xercesc/dom/DOMDocument.hpp>
#include <xercesc/dom/DOMElement.hpp>
#include <xercesc/dom/DOMBuilder.hpp>
#include <xercesc/dom/DOMWriter.hpp>
#include <xercesc/framework/MemBufFormatTarget.hpp>
#include <xercesc/framework/MemBufInputSource.hpp>
#include <xercesc/framework/Wrapper4InputSource.hpp>
#include <xercesc/sax/SAXException.hpp>
#include <xercesc/util/PlatformUtils.hpp>
#include <xercesc/util/XMLException.hpp>
#include <xercesc/validators/schema/SchemaGrammar.hpp>

/* XSD */
#include <xsd/cxx/tree/elements.hxx>
#include <xsd/cxx/tree/exceptions.hxx>

/* Local Codebase */
#include "exceptions/InvalidParameterException.h"
#include "exceptions/UnmarshallerException.h"
#include "handlers/Unmarshaller.h"
#include "handlers/SAML2ErrorHandler.h"
#include "handlers/MetadataOutput.h"
#include "resolver/ResourceResolver.h"
#include "resolver/ExternalKeyResolver.h"
#include "SAML2Defs.h"

#include "handlers/SAMLDocument.h"

XERCES_CPP_NAMESPACE_USE

namespace saml2
{
	/*
	 * Concreate implementation of all unmarshalling operations supported by the library
	 */
	template <class T>
	class UnmarshallerImpl : public saml2::Unmarshaller<T>
	{
		public:
			UnmarshallerImpl(std::string schemaDir, std::vector<std::string> schemaList);
			UnmarshallerImpl(std::string schemaDir, std::vector<std::string> schemaList, ExternalKeyResolver* extKeyResolver);

			~UnmarshallerImpl();

			T* unMarshallSigned (const SAMLDocument& document, XSECCryptoKey* pk, bool keepDOM = false);
			T* unMarshallSigned (const SAMLDocument& document, bool keepDOM = false);
			T* unMarshallUnSigned (const SAMLDocument& document, bool keepDOM = false);
			T* unMarshallUnSignedElement (DOMElement* elem, bool keepDOM = false);
			saml2::MetadataOutput<T>* unMarshallMetadata (const SAMLDocument& document, XSECCryptoKey* pk, bool keepDOM = false);
			
		private:
			void init();
			DOMDocument* validate(const SAMLDocument& document);
			void validateSignature(DOMDocument* doc, XSECCryptoKey* pk);

			ExternalKeyResolver* extKeyResolver;
			std::vector<std::string> schemaList;
			std::string schemaDir;

			SAML2ErrorHandler* errorHandler;
			ResourceResolver* resourceResolver;

			XMLCh* implFlags;
			XMLCh* dsigURI;
			XMLCh* dsigSigElem;
			XMLCh* metadataURI;
			XMLCh* keyDescriptor;
			XMLCh* keyInfo;
			XMLCh* keyName;
			XMLCh* keyValue;
			XMLCh* rsaKeyValue;
			XMLCh* dsaKeyValue;
			XMLCh* dsaP;
			XMLCh* dsaQ;
			XMLCh* dsaG;
			XMLCh* dsaY;
			XMLCh* dsaJ;
			
			DOMImplementationLS* domImpl;
	};

	/*
	 * Constructor for unmarshaller instances that do not require usage of an external key resolver
	 */
	template <class T>
	UnmarshallerImpl<T>::UnmarshallerImpl(std::string schemaDir, std::vector<std::string> schemaList)
	{
		try
		{
			this->schemaDir = schemaDir;
			this->schemaList = schemaList;
			this->extKeyResolver = NULL;

			init();
		}
		catch (XMLException &exc)
		{
			SAML2LIB_UNMAR_EX( "Error during initialisation of Xerces and XMLSec" );
		}
	}

	/*
	 * Constructor for unmarshaller instances that do require usage of an external key resolver
	 */
	template <class T>
	UnmarshallerImpl<T>::UnmarshallerImpl(std::string schemaDir, std::vector<std::string> schemaList, ExternalKeyResolver* extKeyResolver)
	{
		if(extKeyResolver == NULL)
			SAML2LIB_INVPARAM_EX("Supplied external key resolver was NULL");
			
		try
		{
			this->schemaDir = schemaDir;
			this->schemaList = schemaList;
			this->extKeyResolver = extKeyResolver;

			init();
		}
		catch (XMLException &exc)
		{
			SAML2LIB_UNMAR_EX_CAUSE( "Error during initialisation of Xerces and XMLSec", exc.getMessage() );
		}
	}

	/*
	 * Destructor, frees all memory and terminates usage of Xerces and XSEC
	 */
	template <class T>
	UnmarshallerImpl<T>::~UnmarshallerImpl()
	{
		
		delete errorHandler;
		delete resourceResolver;

		/* Cleanup XMLCh strings */
		XMLString::release(&implFlags);
		XMLString::release(&dsigURI);
		XMLString::release(&dsigSigElem);
		XMLString::release(&metadataURI);
		XMLString::release(&keyDescriptor);
		XMLString::release(&keyInfo);
		XMLString::release(&keyName);
		XMLString::release(&keyValue);
		XMLString::release(&rsaKeyValue);
		XMLString::release(&dsaKeyValue);
		XMLString::release(&dsaP);
		XMLString::release(&dsaQ);
		XMLString::release(&dsaG);
		XMLString::release(&dsaY);
		XMLString::release(&dsaJ);
		
		XSECPlatformUtils::Terminate();
		XMLPlatformUtils::Terminate();
	}

	/*
	 * Initialization tasks common to both types of unmarshaller, initializes members,
	 * Xerces and XSEC libraries
	 */
	template <class T>
	void UnmarshallerImpl<T>::init()
	{
		XMLPlatformUtils::Initialize();
		XSECPlatformUtils::Initialise();

		errorHandler = NULL;
		resourceResolver = NULL;

		errorHandler =  new SAML2ErrorHandler();
		resourceResolver = new ResourceResolver( this->schemaDir );

		implFlags = XMLString::transcode( IMPL_FLAGS );
		dsigURI = XMLString::transcode ( DSIG_URI );
		dsigSigElem = XMLString::transcode ( DSIG_SIG_ELEM );
		metadataURI = XMLString::transcode ( METADATA_URI );
		keyDescriptor = XMLString::transcode ( KEY_DESCRIPTOR );
		keyInfo = XMLString::transcode ( KEY_INFO );
		keyName = XMLString::transcode ( KEY_NAME );
		keyValue = XMLString::transcode ( KEY_VALUE );
		rsaKeyValue = XMLString::transcode ( RSA_KEY_VALUE );
		dsaKeyValue = XMLString::transcode ( DSA_KEY_VALUE );
		dsaP = XMLString::transcode ( DSA_P );
		dsaQ = XMLString::transcode ( DSA_Q );
		dsaG = XMLString::transcode ( DSA_G );
		dsaY = XMLString::transcode ( DSA_Y );
		dsaJ = XMLString::transcode ( DSA_J );

		domImpl = DOMImplementationRegistry::getDOMImplementation(implFlags);
	}

