esoeproject/esoeproject/saml2cpp/includes/handlers/impl/UnmarshallerImpl.h
	/*
	 * Unmarshalls an instance of a SAML document and verifies all cryptography, on success returns the
	 * associated XSD generated object representation for further processing
	 * 
	 * @param doc Byte representation of the document to process, caller responsible for memory management
	 * @param size Number of bytes present in the doc buffer that should be processed
	 * @param pk The public key to be used for cryptography validation operations, caller responsible for memory management
	 * @param keepDOM Indicates if the dom structure should be retained for use by the caller, default false
	 * 
	 * @exception UnmarshallerException, wrapped exception detailing error state
	 * @exception InvalidParameterException, when invalid data is fed to the library
	 */
	template <class T>
	T*  UnmarshallerImpl<T>::unMarshallSigned (const SAMLDocument& document, XSECCryptoKey* pk, bool keepDOM)
	{
		DOMDocument* domDoc = NULL;
		T* obj = NULL;
		
		if(document.getData() == NULL || document.getLength() == 0 )
			SAML2LIB_INVPARAM_EX("Supplied xml document was NULL or empty.");
			
		if(pk == NULL)
			SAML2LIB_INVPARAM_EX("Supplied public key was NULL");
			
		try
		{
			domDoc = validate(document);
			validateSignature(domDoc, pk);
			if(keepDOM)
			{
				/* Note that the memory referenced by domDoc becomes owned by our XSD object implementation
				 * in this case and will be cleaned up as required when this object is removed 
				 */
				obj = new T ( *domDoc->getDocumentElement(), xsd::cxx::tree::flags::keep_dom | xsd::cxx::tree::flags::dont_validate | xsd::cxx::tree::flags::dont_initialize);
			}
			else
			{
				obj = new T ( *domDoc->getDocumentElement(), xsd::cxx::tree::flags::dont_validate | xsd::cxx::tree::flags::dont_initialize);
				domDoc->release();
			}
		}
		catch (xsd::cxx::tree::parsing< wchar_t > &exc)
		{
			SAML2LIB_UNMAR_EX_CAUSE( "XSD Parsing exception while unmarshalling signed document", exc.what() );
		}
		catch (xsd::cxx::tree::expected_element< wchar_t > &exc)
		{
			SAML2LIB_UNMAR_EX_CAUSE( "XSD expected elements exception while unmarshalling signed document", exc.what() );
		}
		catch (xsd::cxx::tree::unexpected_element< wchar_t > &exc)
		{
			SAML2LIB_UNMAR_EX_CAUSE( "XSD unexpected elements exception while unmarshalling signed document", exc.what() );
		}
		catch (xsd::cxx::tree::expected_attribute< wchar_t > &exc)
		{
			SAML2LIB_UNMAR_EX_CAUSE( "XSD expected attribute exception while unmarshalling signed document", exc.what() );
		}
		catch (xsd::cxx::tree::unexpected_enumerator< wchar_t > &exc)
		{
			SAML2LIB_UNMAR_EX_CAUSE( "XSD unexpected enumerator exception while unmarshalling signed document", exc.what() );
		}
		catch (xsd::cxx::tree::no_type_info< wchar_t > &exc)
		{
			SAML2LIB_UNMAR_EX_CAUSE( "XSD no type info exception while unmarshalling signed document", exc.what() );
		}
		catch (xsd::cxx::tree::not_derived< wchar_t > &exc)
		{
			SAML2LIB_UNMAR_EX_CAUSE( "XSD not derived exception while unmarshalling signed document", exc.what() );
		}
		catch (xsd::cxx::tree::exception< wchar_t > &exc)
		{
			SAML2LIB_UNMAR_EX_CAUSE( "XSD generic exception while unmarshalling signed document", exc.what() );
		}
		catch (std::bad_alloc &exc)
		{
			SAML2LIB_UNMAR_EX_CAUSE( "Bad memory alloc while unmarshalling signed document", exc.what() );
		}
		catch(SAXException &exc)
		{
			SAML2LIB_UNMAR_EX_CAUSE( "SAXException while unmarshalling signed document", exc.getMessage() );
		}
		catch(DOMException &exc)
		{
			SAML2LIB_UNMAR_EX_CAUSE( "DOMException while unmarshalling signed document", exc.getMessage() );
		}
		catch(XMLException &exc)
		{
			SAML2LIB_UNMAR_EX_CAUSE( "XMLException while unmarshalling signed document", exc.getMessage() );
		}
		catch(std::exception &exc)
		{
			SAML2LIB_UNMAR_EX_CAUSE( "Exception while unmarshalling signed document", exc.what() );
		}
		catch(...)
		{
			SAML2LIB_UNMAR_EX( "Generic exception while unmarshalling signed document" );
		}

		return obj;
	}

	/*
	 * Unmarshalls an instance of a SAML document and verifies all cryptography, on success returns the
	 * associated XSD generated object representation for further processing. Will utilise external key resolver
	 * set in constructor call
	 * 
	 * @param doc Byte representation of the document to process
	 * @param size Number of bytes present in the doc buffer that should be processed
	 * @param keepDOM Indicates if the dom structure should be retained for use by the caller, default false
	 * 
	 * @exception UnmarshallerException, wrapped exception detailing error state
	 * @exception InvalidParameterException, when invalid data is fed to the library
	 */
	template <class T>
	T*  UnmarshallerImpl<T>::unMarshallSigned (const SAMLDocument& document, bool keepDOM)
	{
		DOMDocument* domDoc;
		T* obj = NULL;

		if(document.getData() == NULL || document.getLength() == 0)
			SAML2LIB_INVPARAM_EX("Supplied xml document was NULL or empty");
			
		try
		{
			if(extKeyResolver == NULL)
				SAML2LIB_UNMAR_EX( "Incorrect constructor called for validation of content with external key resolver, re-initialise unmarshaller correctly" );
				
			domDoc = validate(document);
			validateSignature(domDoc, NULL);
			if(keepDOM)
			{
				/* Note that the memory referenced by domDoc becomes owned by our XSD object implementation
				 * in this case and will be cleaned up as required when this object is removed 
				 */
				obj = new T ( *domDoc->getDocumentElement(), xsd::cxx::tree::flags::keep_dom | xsd::cxx::tree::flags::dont_validate | xsd::cxx::tree::flags::dont_initialize);
			}
			else
			{
				obj = new T ( *domDoc->getDocumentElement(), xsd::cxx::tree::flags::dont_validate | xsd::cxx::tree::flags::dont_initialize);
				domDoc->release();
			}
		}
		catch (xsd::cxx::tree::parsing< wchar_t > &exc)
		{
			SAML2LIB_UNMAR_EX_CAUSE( "XSD Parsing exception while unmarshalling signed document", exc.what() );
		}
		catch (xsd::cxx::tree::expected_element< wchar_t > &exc)
		{
			SAML2LIB_UNMAR_EX_CAUSE( "XSD expected elements exception while unmarshalling signed document", exc.what() );
		}
		catch (xsd::cxx::tree::unexpected_element< wchar_t > &exc)
		{
			SAML2LIB_UNMAR_EX_CAUSE( "XSD unexpected elements exception while unmarshalling signed document", exc.what() );
		}
		catch (xsd::cxx::tree::expected_attribute< wchar_t > &exc)
		{
			SAML2LIB_UNMAR_EX_CAUSE( "XSD expected attribute exception while unmarshalling signed document", exc.what() );
		}
		catch (xsd::cxx::tree::unexpected_enumerator< wchar_t > &exc)
		{
			SAML2LIB_UNMAR_EX_CAUSE( "XSD unexpected enumerator exception while unmarshalling signed document", exc.what() );
		}
		catch (xsd::cxx::tree::no_type_info< wchar_t > &exc)
		{
			SAML2LIB_UNMAR_EX_CAUSE( "XSD no type info exception while unmarshalling signed document", exc.what() );
		}
		catch (xsd::cxx::tree::not_derived< wchar_t > &exc)
		{
			SAML2LIB_UNMAR_EX_CAUSE( "XSD not derived exception while unmarshalling signed document", exc.what() );
		}
		catch (xsd::cxx::tree::exception< wchar_t > &exc)
		{
			SAML2LIB_UNMAR_EX_CAUSE( "XSD generic exception while unmarshalling signed document", exc.what() );
		}
		catch (std::bad_alloc &exc)
		{
			SAML2LIB_UNMAR_EX_CAUSE( "Bad memory alloc while unmarshalling signed document", exc.what() );
		}
		catch(SAXException &exc)
		{
			SAML2LIB_UNMAR_EX_CAUSE( "SAXException while unmarshalling signed document", exc.getMessage() );
		}
		catch(DOMException &exc)
		{
			SAML2LIB_UNMAR_EX_CAUSE( "DOMException while unmarshalling signed document", exc.getMessage() );
		}
		catch(XMLException &exc)
		{
			SAML2LIB_UNMAR_EX_CAUSE( "XMLException while unmarshalling signed document", exc.getMessage() );
		}
		catch(std::exception &exc)
		{
			SAML2LIB_UNMAR_EX_CAUSE( "Exception while unmarshalling signed document", exc.what() );
		}
		catch(...)
		{
			SAML2LIB_UNMAR_EX( "Generic exception while unmarshalling signed document" );
		}

		return obj;
	}

