esoeproject/esoeproject/saml2cpp/includes/handlers/impl/UnmarshallerImpl.h
	/*
	 * Unmarshalls an instance of a SAML document with no verification of cryptography, on success returns the
	 * associated XSD generated object representation for further processing.
	 * 
	 * @param doc Byte representation of the document to process
	 * @param size Number of bytes present in the doc buffer that should be processed
	 * @param keepDOM Indicates if the dom structure should be retained for use by the caller, default false
	 * 
	 * @exception UnmarshallerException, wrapped exception detailing error state
	 * @exception InvalidParameterException, when invalid data is fed to the library
	 */
	template <class T>
	T* UnmarshallerImpl<T>::unMarshallUnSigned (const SAMLDocument& document, bool keepDOM)
	{
		DOMDocument* domDoc;
		T* obj = NULL;

		if(document.getData() == NULL || document.getLength() == 0)
			SAML2LIB_INVPARAM_EX("Supplied xml document was NULL or empty");

		try
		{
			domDoc = validate(document);
			if(keepDOM)
			{
				/* Note that the memory referenced by domDoc becomes owned by our XSD object implementation
				 * in this case and will be cleaned up as required when this object is removed 
				 */
				obj = new T ( *domDoc->getDocumentElement(), xsd::cxx::tree::flags::keep_dom | xsd::cxx::tree::flags::dont_validate | xsd::cxx::tree::flags::dont_initialize);
			}
			else
			{
				obj = new T ( *domDoc->getDocumentElement(), xsd::cxx::tree::flags::dont_validate | xsd::cxx::tree::flags::dont_initialize);
				domDoc->release();
			}
		}
		catch (xsd::cxx::tree::parsing< wchar_t > &exc)
		{
			SAML2LIB_UNMAR_EX_CAUSE( "XSD Parsing exception while unmarshalling unsigned document", exc.what() );
		}
		catch (xsd::cxx::tree::expected_element< wchar_t > &exc)
		{
			SAML2LIB_UNMAR_EX_CAUSE( "XSD expected elements exception while unmarshalling unsigned document", exc.what() );
		}
		catch (xsd::cxx::tree::unexpected_element< wchar_t > &exc)
		{
			SAML2LIB_UNMAR_EX_CAUSE( "XSD unexpected elements exception while unmarshalling unsigned document", exc.what() );
		}
		catch (xsd::cxx::tree::expected_attribute< wchar_t > &exc)
		{
			SAML2LIB_UNMAR_EX_CAUSE( "XSD expected attribute exception while unmarshalling unsigned document", exc.what() );
		}
		catch (xsd::cxx::tree::unexpected_enumerator< wchar_t > &exc)
		{
			SAML2LIB_UNMAR_EX_CAUSE( "XSD unexpected enumerator exception while unmarshalling unsigned document", exc.what() );
		}
		catch (xsd::cxx::tree::no_type_info< wchar_t > &exc)
		{
			SAML2LIB_UNMAR_EX_CAUSE( "XSD no type info exception while unmarshalling unsigned document", exc.what() );
		}
		catch (xsd::cxx::tree::not_derived< wchar_t > &exc)
		{
			SAML2LIB_UNMAR_EX_CAUSE( "XSD not derived exception while unmarshalling unsigned document", exc.what() );
		}
		catch (xsd::cxx::tree::exception< wchar_t > &exc)
		{
			SAML2LIB_UNMAR_EX_CAUSE( "XSD generic exception while unmarshalling unsigned document", exc.what() );
		}
		catch (std::bad_alloc &exc)
		{
			SAML2LIB_UNMAR_EX_CAUSE( "Bad memory alloc while unmarshalling unsigned document", exc.what() );
		}
		catch(SAXException &exc)
		{
			SAML2LIB_UNMAR_EX_CAUSE( "SAXException while unmarshalling unsigned document", exc.getMessage() );
		}
		catch(DOMException &exc)
		{
			SAML2LIB_UNMAR_EX_CAUSE( "DOMException while unmarshalling unsigned document", exc.getMessage() );
		}
		catch(XMLException &exc)
		{
			SAML2LIB_UNMAR_EX_CAUSE( "XMLException while unmarshalling unsigned document", exc.getMessage() );
		}
		catch(std::exception &exc)
		{
			SAML2LIB_UNMAR_EX_CAUSE( "Exception while unmarshalling unsigned document", exc.what() );
		}
		catch(...)
		{
			SAML2LIB_UNMAR_EX( "Generic exception while unmarshalling unsigned document" );
		}
		
		return obj;
	}
	
	/*
	 * Unmarshalls an instance of DOMElement with no verification of cryptography, on success returns the
	 * associated XSD generated object representation for further processing, this is generally to be used for ##anyType elements
	 * extracted from an already processed XSD document, there is no element level validation performed, callers should exercise care
	 * with returned objects when using.
	 * 
	 * @param elem DOMElement to process, caller is responsible for ensuring valid element and for all memory management for this element.
	 * @param keepDOM Indicates if the dom structure should be retained for use by the caller, default false
	 * 
	 * @exception UnmarshallerException, wrapped exception detailing error state
	 * @exception InvalidParameterException, when invalid data is fed to the library
	 */
	template <class T>
	T* UnmarshallerImpl<T>::unMarshallUnSignedElement (DOMElement* elem, bool keepDOM)
	{
		T* obj = NULL;

		if(elem == NULL)
			SAML2LIB_INVPARAM_EX("Supplied DOMElement was NULL");

		try
		{
			if(keepDOM)
			{
				/* Note that the memory referenced by domDoc becomes owned by our XSD object implementation
				 * in this case and will be cleaned up as required when this object is removed 
				 */
				/* Not anymore - using the XSD internal flag "not_root" to prevent this. Since we would
				 * never use unMarshallUnSignedElement at the root of a document, deleting the DOM from the
				 * XSD object will be an invalid operation (it will already be deleted by another XSD object)
				 * In addition, this gives us consistent behaviour (from a memory management perspective) for
				 * keepDOM=true and keepDOM=false (i.e. caller is responsible for deleting the DOM object).
				 * - SM
				 */
				obj = new T ( *elem, xsd::cxx::tree::flags::keep_dom | xsd::cxx::tree::flags::not_root | xsd::cxx::tree::flags::dont_validate | xsd::cxx::tree::flags::dont_initialize);
			}
			else
			{
				obj = new T ( *elem, xsd::cxx::tree::flags::dont_validate | xsd::cxx::tree::flags::dont_initialize);
			}
			return obj;
		}
		catch (xsd::cxx::tree::parsing< wchar_t > &exc)
		{
			SAML2LIB_UNMAR_EX_CAUSE( "XSD Parsing exception while unmarshalling unsigned document", exc.what() );
		}
		catch (xsd::cxx::tree::expected_element< wchar_t > &exc)
		{
			SAML2LIB_UNMAR_EX_CAUSE( "XSD expected elements exception while unmarshalling unsigned document", exc.what() );
		}
		catch (xsd::cxx::tree::unexpected_element< wchar_t > &exc)
		{
			SAML2LIB_UNMAR_EX_CAUSE( "XSD unexpected elements exception while unmarshalling unsigned document", exc.what() );
		}
		catch (xsd::cxx::tree::expected_attribute< wchar_t > &exc)
		{
			SAML2LIB_UNMAR_EX_CAUSE( "XSD expected attribute exception while unmarshalling unsigned document", exc.what() );
		}
		catch (xsd::cxx::tree::unexpected_enumerator< wchar_t > &exc)
		{
			SAML2LIB_UNMAR_EX_CAUSE( "XSD unexpected enumerator exception while unmarshalling unsigned document", exc.what() );
		}
		catch (xsd::cxx::tree::no_type_info< wchar_t > &exc)
		{
			SAML2LIB_UNMAR_EX_CAUSE( "XSD no type info exception while unmarshalling unsigned document", exc.what() );
		}
		catch (xsd::cxx::tree::not_derived< wchar_t > &exc)
		{
			SAML2LIB_UNMAR_EX_CAUSE( "XSD not derived exception while unmarshalling unsigned document", exc.what() );
		}
		catch (xsd::cxx::tree::exception< wchar_t > &exc)
		{
			SAML2LIB_UNMAR_EX_CAUSE( "XSD generic exception while unmarshalling unsigned document", exc.what() );
		}
		catch (std::bad_alloc &exc)
		{
			SAML2LIB_UNMAR_EX_CAUSE( "Bad memory alloc while unmarshalling unsigned document", exc.what() );
		}
		catch(SAXException &exc)
		{
			SAML2LIB_UNMAR_EX_CAUSE( "SAXException while unmarshalling unsigned document", exc.getMessage() );
		}
		catch(DOMException &exc)
		{
			SAML2LIB_UNMAR_EX_CAUSE( "DOMException while unmarshalling unsigned document", exc.getMessage() );
		}
		catch(XMLException &exc)
		{
			SAML2LIB_UNMAR_EX_CAUSE( "XMLException while unmarshalling unsigned document", exc.getMessage() );
		}
		catch(std::exception &exc)
		{
			SAML2LIB_UNMAR_EX_CAUSE( "Exception while unmarshalling unsigned document", exc.what() );
		}
		catch(...)
		{
			SAML2LIB_UNMAR_EX( "Generic exception while unmarshalling unsigned document" );
		}
		
		return obj;
	}

