esoeproject/esoeproject/saml2cpp/includes/handlers/impl/UnmarshallerImpl.h
						if(Pn->getLength() == 1)
						{
							P = XMLString::transcode( Pn->item(0)->getFirstChild()->getNodeValue());
							keyData.p = std::string( P, XMLString::stringLen(Pn->item(0)->getFirstChild()->getNodeValue()) );
						}
						if(Qn->getLength() == 1)
						{	 
							Q = XMLString::transcode( Qn->item(0)->getFirstChild()->getNodeValue());
							keyData.q = std::string( Q, XMLString::stringLen(Qn->item(0)->getFirstChild()->getNodeValue()) );
						}
						if(Gn->getLength() == 1)
						{	
							G = XMLString::transcode( Gn->item(0)->getFirstChild()->getNodeValue());
							keyData.g = std::string( G, XMLString::stringLen(Gn->item(0)->getFirstChild()->getNodeValue()) );
						}
						if(Yn->getLength() == 1)
						{
							Y = XMLString::transcode( Yn->item(0)->getFirstChild()->getNodeValue());
							keyData.y = std::string( Y, XMLString::stringLen(Yn->item(0)->getFirstChild()->getNodeValue()) );
						}
						if(Jn->getLength() == 1)
						{
							J =  XMLString::transcode( Jn->item(0)->getFirstChild()->getNodeValue());
							keyData.j = std::string( J, XMLString::stringLen(Jn->item(0)->getFirstChild()->getNodeValue()) );
						} 
						
						keyName = XMLString::transcode( keyNameList->item(0)->getFirstChild()->getNodeValue());
						keyData.keyName = std::string( keyName );
						
						/* insert the created crypto key into the response map with its map key being the key name */
						output->keyList.insert(std::make_pair( keyName, keyData ));
						
						delete keyName;	
						XMLString::release(&P);
						XMLString::release(&Q);
						XMLString::release(&G);
						XMLString::release(&Y);
						XMLString::release(&J);					
					}
					
					if(!validKeyData)
						SAML2LIB_UNMAR_EX( "While parsing key info invalid Key Data type found, support for DSA and RSA keys only currently" );  
				}
			}			
			
			if(keepDOM)
			{
				/* Note that the memory referenced by domDoc becomes owned by our XSD object implementation
				 * in this case and will be cleaned up as required when this object is removed 
				 */
				xmlObj = new T ( *domDoc->getDocumentElement(), xsd::cxx::tree::flags::keep_dom | xsd::cxx::tree::flags::dont_validate | xsd::cxx::tree::flags::dont_initialize);
			}
			else
			{
				xmlObj = new T ( *domDoc->getDocumentElement(), xsd::cxx::tree::flags::dont_validate | xsd::cxx::tree::flags::dont_initialize);
				domDoc->release();
			}
			
			output->xmlObj = xmlObj;			
		}
		catch (xsd::cxx::tree::parsing< wchar_t > &exc)
		{
			SAML2LIB_UNMAR_EX_CAUSE( "XSD Parsing exception while unmarshalling metadata", exc.what() );
		}
		catch (xsd::cxx::tree::expected_element< wchar_t > &exc)
		{
			SAML2LIB_UNMAR_EX_CAUSE( "XSD expected elements exception while unmarshalling metadata", exc.what() );
		}
		catch (xsd::cxx::tree::unexpected_element< wchar_t > &exc)
		{
			SAML2LIB_UNMAR_EX_CAUSE( "XSD unexpected elements exception while unmarshalling metadata", exc.what() );
		}
		catch (xsd::cxx::tree::expected_attribute< wchar_t > &exc)
		{
			SAML2LIB_UNMAR_EX_CAUSE( "XSD expected attribute exception while unmarshalling metadata", exc.what() );
		}
		catch (xsd::cxx::tree::unexpected_enumerator< wchar_t > &exc)
		{
			SAML2LIB_UNMAR_EX_CAUSE( "XSD unexpected enumerator exception while unmarshalling metadata", exc.what() );
		}
		catch (xsd::cxx::tree::no_type_info< wchar_t > &exc)
		{
			SAML2LIB_UNMAR_EX_CAUSE( "XSD no type info exception while unmarshalling metadata", exc.what() );
		}
		catch (xsd::cxx::tree::not_derived< wchar_t > &exc)
		{
			SAML2LIB_UNMAR_EX_CAUSE( "XSD not derived exception while unmarshalling metadata", exc.what() );
		}
		catch (xsd::cxx::tree::exception< wchar_t > &exc)
		{
			SAML2LIB_UNMAR_EX_CAUSE( "XSD generic exception while unmarshalling metadata", exc.what() );
		}
		catch (std::bad_alloc &exc)
		{
			SAML2LIB_UNMAR_EX_CAUSE( "Bad memory alloc while unmarshalling metadata", exc.what() );
		}
		catch(SAXException &exc)
		{
			SAML2LIB_UNMAR_EX_CAUSE( "SAXException while unmarshalling metadata", exc.getMessage() );
		}
		catch(DOMException &exc)
		{
			SAML2LIB_UNMAR_EX_CAUSE( "DOMException while unmarshalling metadata", exc.getMessage() );
		}
		catch(XMLException &exc)
		{
			SAML2LIB_UNMAR_EX_CAUSE( "XMLException while unmarshalling metadata", exc.getMessage() );
		}
		catch(std::exception &exc)
		{
			SAML2LIB_UNMAR_EX_CAUSE( "Exception while unmarshalling metadata", exc.what() );
		}
		catch(...)
		{
			SAML2LIB_UNMAR_EX( "Generic exception while unmarshalling metadata" );
		}
		
		return output;
	}

	/*
	 * Utilises Xerces DOM level 3 DOMBuilder object to parse and validate the supplied DOMDocument
	 * instance, returns instance of DOMDocument generated by parsing
	 */
	template <class T>
	DOMDocument* UnmarshallerImpl<T>::validate (const SAMLDocument& document)
	{
		Wrapper4InputSource* wrapedSource = NULL;
		DOMBuilder* parser = NULL;
		DOMDocument* domDoc = NULL;
		MemBufInputSource* inputSource = NULL;
		XMLCh* schema = NULL;

		try
		{
			parser = this->domImpl->createDOMBuilder(DOMImplementationLS::MODE_SYNCHRONOUS, NULL);

			/* Setup all the required parser variables, NB dont trust 'defaults' */
			parser->setErrorHandler(this->errorHandler);
			parser->setEntityResolver(this->resourceResolver);

			parser->setFeature(XMLUni::fgXercesSchema, true);
			parser->setFeature(XMLUni::fgDOMValidation, true);
			parser->setFeature(XMLUni::fgDOMNamespaces, true);
			parser->setFeature(XMLUni::fgDOMWhitespaceInElementContent, false);
			parser->setFeature(XMLUni::fgDOMEntities, false);
			parser->setFeature(XMLUni::fgXercesUseCachedGrammarInParse, true);
			parser->setFeature(XMLUni::fgXercesUserAdoptsDOMDocument, true);

			/* This is particuarly important so that signatures are not corrupted*/
			parser->setFeature(XMLUni::fgDOMDatatypeNormalization, false);

			for(std::vector<std::string>::iterator i = this->
			        schemaList.begin();
			        i != this->schemaList.end();
			        i++)
			{
				schema = XMLString::transcode ( i->c_str() );
				parser->loadGrammar(schema, Grammar::SchemaGrammarType, true);
				XMLString::release(&schema);
			}

			inputSource = new MemBufInputSource ((const XMLByte*)document.getData(), document.getLength(), UNMARSHALLER_ID);
			wrapedSource = new Wrapper4InputSource(inputSource);
			domDoc = parser->parse(*wrapedSource);

			parser->release();
			parser = NULL;
			delete wrapedSource;
			wrapedSource = NULL;
		}
		catch(...)
		{
			/* Clean up any memory allocated and throw back up stack */
			if(schema != NULL)
				XMLString::release(&schema);

			if(parser != NULL)
			{
				parser->release();
				parser = NULL;
			}
			
			if(wrapedSource != NULL)
			{
				delete wrapedSource;
				wrapedSource = NULL;
			}
			throw;
		}
		
		return domDoc;
	}

