esoeproject/esoeproject/saml2cpp/includes/handlers/impl/UnmarshallerImpl.h
	/*
	 * Performs all cryptography operations associated with validating cryptography in the supplied domDocument,
	 * utilises the apache XML Security C library
	 */
	template <class T>
	void UnmarshallerImpl<T>::validateSignature (DOMDocument* doc, XSECCryptoKey* pk)
	{
		XSECProvider prov;
		DSIGSignature* sig = NULL;
		DSIGReferenceList* refList = NULL;
		DOMNodeList* nodeList = NULL;
		XMLSize_t size;
		XMLSize_t refListSize;
		bool validSig;

		try
		{
			nodeList = doc->getElementsByTagNameNS(this->dsigURI, this->dsigSigElem);
			size = nodeList->getLength();

			if(size == 0)
				SAML2LIB_UNMAR_EX( "Document contained no signature elements to validate on" );
				
			for(XMLSize_t i = 0; i < size; i++)
			{
				validSig = false;
				sig = prov.newSignatureFromDOM(doc, nodeList->item(i));
				sig->load();
				
				/* Use either the supplied pk or if null the registered instance of external key resolver */
				if( pk != NULL )
					sig->setSigningKey(pk->clone());
				else
					sig->setKeyInfoResolver(this->extKeyResolver);

				validSig = sig->verify();

				if(!validSig)
				{
					if (!sig->verifySignatureOnly())
					{
						SAML2LIB_UNMAR_EX( "Signature validation failed with invalid signature for supplied public key" );
					}
					else
					{
						refList = sig->getReferenceList();
						refListSize = nodeList->getLength();

						for(XMLSize_t j = 0; j < refListSize; i++)
						{
							if( !refList->item(j)->checkHash() )
							{
								SAML2LIB_UNMAR_EX( "Signature validation failed with invalid supplied reference, the request document has been tampered with or the parent element to this signature block has no ID attribute");
							}
						}
					}
				}
				
				prov.releaseSignature(sig);
				sig = NULL;
			}
		}
		catch (XSECCryptoException &e)
		{
			if(sig != NULL)
				prov.releaseSignature(sig);

			SAML2LIB_UNMAR_EX_CAUSE( "An exception occurred during an encryption operation", e.getMsg() );
		}
		catch (XSECException &e)
		{
			if(sig != NULL)
				prov.releaseSignature(sig);

			SAML2LIB_UNMAR_EX_CAUSE( "An exception occurred during a security operation", e.getMsg() );
		}
		catch(...)
		{
			if(sig != NULL)
				prov.releaseSignature(sig);

			throw;
		}
	}
}

#endif /*UNMARSHALLERIMPL_H_*/
